[
    {
        "title": "Schotter",
        "serie": "Hommage à Georg Nees",
        "number": "1.1",
        "description": "Schotter est une des oeuvres les plus connues de Georg Nees, artiste allemand pionnier de l'art génératif dans les années 60. L'oeuvre est composée d'une grille de carrés, de plus en plus dérangés.<br>Cliquez pour regénérer.",
        "slug": "schotter",
        "original": "http://dada.compart-bremen.de/item/artwork/1"
    },
    {
        "title": "Untitled (Werkstatt Edition Kroll)",
        "serie": "Hommage à Georg Nees",
        "number": "1.2",
        "description": "Cette oeuvre consiste en une grille dans laquelle un nombre croissant de points sont tirés sur un cercle, puis reliés aléatoirement, mélangeant ordre et chaos.<br>Cliquez pour regénérer.",
        "slug": "werkstatt",
        "original": "https://collections.vam.ac.uk/item/O1347720/werkstatt-edition-kroll-print-georg-nees/"
    },
    {
        "title": "Untitled (Bild 13)",
        "serie": "Hommage à Georg Nees",
        "number": "1.3",
        "description": "Deux ensembles de cercles qui se rejoignent en un point tangent.<br>Cliquez pour regénérer.",
        "slug": "bild13",
        "original": "http://dada.compart-bremen.de/item/artwork/1456"
    },
    {
        "title": "Motherboard",
        "serie": "Géométries simples",
        "number": "2.1",
        "description": "Exercice en \"rectangle packing\" dans une grille modulaire, qui rappelle un peu Mondrian. L'algorithme fonctionne en cherchant d'abord le plus grand rectangle vide disponible dans la grille, puis remplit un rectangle aléatoire borné à ce rectangle maximal, alors que certains sont laissés vides. Cet algorithme, visualisé par l'animation des ajouts successifs de rectangles, rappelle le processus automatique de manufacture de circuits imprimés.",
        "slug": "motherboard"
    },
    {
        "title": "Moiré",
        "serie": "Géométries simples",
        "number": "2.2",
        "description": "Cette expérience vise à reproduire l'effet de Moiré en superposant plusieurs grilles en rotation, créant une série de motifs complexes.<br>Cliquer pour regénérer les couleurs.",
        "slug": "moire"
    },
    {
        "title": "Lignes",
        "serie": "Géométries simples",
        "number": "2.3",
        "description": "Chaque cellule d'une grille est métamorphosée par une orientation choisie par incréments de 45°, donnant naissance à une ligne qui s'entrelace avec d'autres pour former un réseau complexe de symboles où l'ordre se marie au chaos.<br>Cliquez pour regénérer.",
        "slug": "lignes"
    },
    {
        "title": "Waves Sinescape",
        "serie": "Sinescapes",
        "number": "3.1",
        "description": "Cette oeuvre se déploie au travers d'une toile infinie de lignes sinueuses, évoquant une topographie imaginaire en perpétuelle évolution. Les oscillations sont le résultat d'un jeu subtile entre des composantes harmoniques sinusoïdales générées aléatoirement et des éléments de bruit de Perlin.",
        "slug": "waves-sinescape"
    },
    {
        "title": "Golden Sinescape",
        "serie": "Sinescapes",
        "number": "3.2",
        "description": "Un paysage unique, créé à base de rectangles d'or placés selon une série de courbes sinusoïdales.",
        "slug": "golden-sinescape"
    },
    {
        "title": "Générateur de filaments",
        "serie": "Sinescapes",
        "number": "3.3",
        "description": "Probablement mon oeuvre la plus aboutie, ce générateur de filaments dispose de 12 paramètres, choisis au hasard à chaque génération, qui produisent une grande variété de formes et de textures.<br>Cliquez pour regénérer.",
        "slug": "filaments-generator"
    },
    {
        "title": "Filaments",
        "serie": "Sinescapes",
        "number": "3.3b",
        "description": "Une sélection de paramètres avec le générateur précédent, qui produit des filaments à la fois ordonnés et chaotiques, provoquant une expérience esthétique singulière.<br>Cliquez pour regénérer.",
        "slug": "filaments"
    }
]